espressif/esp-idf/components/nvs_flash/test_apps/sdkconfig.ci.spiram
# Restricting to ESP32
CONFIG_IDF_TARGET="esp32"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_INT_WDT_TIMEOUT_MS=3000
CONFIG_NVS_ALLOCATE_CACHE_IN_SPIRAM=y
